grivera90/MFRC522_STM32_cpp/mfrc522/MFRC522.cpp
/*
* MFRC522.cpp - Library to use ARDUINO RFID MODULE KIT 13.56 MHZ WITH TAGS SPI W AND R BY COOQROBOT.
* NOTE: Please also check the comments in MFRC522.h - they provide useful hints and background information.
* Released into the public domain.
*/

//#include <Arduino.h>
#include "MFRC522.h"
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"
#include "cstring"
#include <stdio.h>

#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define SPI1_CS_Pin GPIO_PIN_4
#define SPI1_CS_GPIO_Port GPIOA
#define RESET_PWRDOWN_Pin GPIO_PIN_0
#define RESET_PWRDOWN_GPIO_Port GPIOB

extern SPI_HandleTypeDef hspi1;
extern UART_HandleTypeDef huart1;
/////////////////////////////////////////////////////////////////////////////////////
// Functions for setting up the Arduino
/////////////////////////////////////////////////////////////////////////////////////
/**
 * Constructor.
 */
MFRC522::MFRC522(): MFRC522(SPI1_CS_GPIO_Port, SPI1_CS_Pin, NULL, UINT16_MAX)
{
} // End constructor

/**
 * Constructor.
 * Prepares the output pins.
 */
///< Arduino pin connected to MFRC522's reset and power down input (Pin 6, NRSTPD, active low). If there is no connection from the CPU to NRSTPD, set this to UINT8_MAX. In this case, only soft reset will be used in PCD_Init().
MFRC522::MFRC522(GPIO_TypeDef *resetPowerDownPort, uint16_t resetPowerDownPin): MFRC522(SPI1_CS_GPIO_Port, SPI1_CS_Pin, resetPowerDownPort, resetPowerDownPin)
{
}

/**
 * Constructor.
 * Prepares the output pins.
 */
MFRC522::MFRC522(GPIO_TypeDef *chipSelectPort, uint16_t chipSelectPin, GPIO_TypeDef *resetPowerDownPort, uint16_t resetPowerDownPin) {

	_chipSelectPort = chipSelectPort;
	_chipSelectPin = chipSelectPin;
	_resetPowerDownPort = resetPowerDownPort;
	_resetPowerDownPin = resetPowerDownPin;
} // End constructor

/////////////////////////////////////////////////////////////////////////////////////
// Basic interface functions for communicating with the MFRC522
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Writes a uint8_t to the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
void MFRC522::PCD_WriteRegister(	PCD_Register reg,	///< The register to write to. One of the PCD_Register enums.
									uint8_t value			///< The value to write.
								) {

	uint8_t _reg = reg;
	uint8_t buff[2];

	buff[0] = _reg;
	buff[1] = value;

	HAL_GPIO_WritePin(_chipSelectPort, _chipSelectPin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi1, &_reg, 1, HAL_MAX_DELAY);
	HAL_SPI_Transmit(&hspi1, &value, 1, HAL_MAX_DELAY);
	HAL_GPIO_WritePin(_chipSelectPort, _chipSelectPin, GPIO_PIN_SET);

} // End PCD_WriteRegister()

/**
 * Writes a number of bytes to the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
void MFRC522::PCD_WriteRegister(	PCD_Register reg,	///< The register to write to. One of the PCD_Register enums.
									uint8_t count,			///< The number of bytes to write to the register
									uint8_t *values		///< The values to write. Byte array.
								) {

	uint8_t _reg = reg;
	HAL_GPIO_WritePin(_chipSelectPort, _chipSelectPin, GPIO_PIN_RESET);

	HAL_SPI_Transmit(&hspi1, &_reg, 1, HAL_MAX_DELAY);

	for(uint8_t i = 0; i < count; i++)
		HAL_SPI_Transmit(&hspi1, &values[i], 1, HAL_MAX_DELAY);

	HAL_GPIO_WritePin(_chipSelectPort, _chipSelectPin, GPIO_PIN_SET);

} // End PCD_WriteRegister()

/**
 * Reads a uint8_t from the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
uint8_t MFRC522::PCD_ReadRegister(	PCD_Register reg	///< The register to read from. One of the PCD_Register enums.
								) {

	uint8_t value;
	uint8_t _reg = reg | 0x80;

	HAL_GPIO_WritePin(_chipSelectPort, _chipSelectPin, GPIO_PIN_RESET);

	HAL_SPI_Transmit(&hspi1, &_reg, 1, HAL_MAX_DELAY);

	HAL_SPI_Transmit(&hspi1, 0x00, 1, HAL_MAX_DELAY);

	HAL_SPI_Receive(&hspi1, &value, 1, HAL_MAX_DELAY);

	HAL_GPIO_WritePin(_chipSelectPort, _chipSelectPin, GPIO_PIN_SET);

	return value;

} // End PCD_ReadRegister()

/**
 * Reads a number of bytes from the specified register in the MFRC522 chip.
 * The interface is described in the datasheet section 8.1.2.
 */
void MFRC522::PCD_ReadRegister(	PCD_Register reg,	///< The register to read from. One of the PCD_Register enums.
								uint8_t count,			///< The number of bytes to read
								uint8_t *values,		///< Byte array to store the values in.
								uint8_t rxAlign		///< Only bit positions rxAlign..7 in values[0] are updated.
								) {

	if (count == 0)
	{
		return;
	}
	uint8_t address = 0x80 | reg;				// MSB == 1 is for reading. LSB is not used in address. Datasheet section 8.1.2.3.
	uint8_t index = 0;							// Index in values array.
	uint8_t value = 0;

	HAL_GPIO_WritePin(_chipSelectPort, _chipSelectPin, GPIO_PIN_RESET);

	count--;
	HAL_SPI_Transmit(&hspi1, &address, 1, HAL_MAX_DELAY);

	if (rxAlign) {		// Only update bit positions rxAlign..7 in values[0]
		// Create bit mask for bit positions rxAlign..7
		uint8_t mask = (0xFF << rxAlign) & 0xFF;
		// Read value and tell that we want to read the same address again.
#if 0
		HAL_SPI_Transmit(&hspi1, &address, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi1, &value, 1, HAL_MAX_DELAY);
#else
		HAL_SPI_TransmitReceive(&hspi1, &address ,&value, 1, HAL_MAX_DELAY);
#endif
		// Apply mask to both current value of values[0] and the new data in value.
		values[0] = (values[0] & ~mask) | (value & mask);
		index++;
	}
	while (index < count) {
#if 0
		HAL_SPI_Transmit(&hspi1, &address, 1, HAL_MAX_DELAY);
		HAL_SPI_Receive(&hspi1, &values[index], 1, HAL_MAX_DELAY);
#else
		HAL_SPI_TransmitReceive(&hspi1, &address, &values[index], 1, HAL_MAX_DELAY);	// Read value and tell that we want to read the same address again.
#endif
		index++;
	}

#if 1
	HAL_SPI_Transmit(&hspi1, 0x00, 1, HAL_MAX_DELAY);
	HAL_SPI_Receive(&hspi1, &values[index], 1, HAL_MAX_DELAY);	// Read the final uint8_t. Send 0 to stop reading.
#else
	HAL_SPI_Receive(&hspi1, &values[index], 1, HAL_MAX_DELAY);
#endif

