grivera90/MFRC522_STM32_cpp/mfrc522/MFRC522.cpp
	// Lookup which version
	switch(v) {
		case 0x88: HAL_UART_Transmit(&huart1, (uint8_t *) " = (clone)\r\n", 12, 200);  break;
		case 0x90: HAL_UART_Transmit(&huart1, (uint8_t *) " = v0.0\r\n", 9, 200);      break;
		case 0x91: HAL_UART_Transmit(&huart1, (uint8_t *) " = v1.0\r\n", 9, 200);      break;
		case 0x92: HAL_UART_Transmit(&huart1, (uint8_t *) " = v2.0\r\n", 9, 200);      break;
		case 0x12: HAL_UART_Transmit(&huart1, (uint8_t *) " = counterfeit chip\r\n", 21, 200);      break;
		default:   HAL_UART_Transmit(&huart1, (uint8_t *) " = (unknown)\r\n", 14, 200);
	}
	// When 0x00 or 0xFF is returned, communication probably failed
	if ((v == 0x00) || (v == 0xFF))
	{
		msgdebug_size = sprintf(msgdebug, "WARNING: Communication failure, is the MFRC522 properly connected? v: 0x%02X\r\n", v);
		HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 500);
	}

} // End PCD_DumpVersionToSerial()

/**
 * Dumps debug info about the selected PICC to Serial.
 * On success the PICC is halted after dumping the data.
 * For MIFARE Classic the factory default key of 0xFFFFFFFFFFFF is tried.  
 */
void MFRC522::PICC_DumpToSerial(Uid *uid	///< Pointer to Uid struct returned from a successful PICC_Select().
								) {
	MIFARE_Key key;

	// Dump UID, SAK and Type
	PICC_DumpDetailsToSerial(uid);

	// Dump contents
	PICC_Type piccType = PICC_GetType(uid->sak);
	switch (piccType) {
		case PICC_TYPE_MIFARE_MINI:
		case PICC_TYPE_MIFARE_1K:
		case PICC_TYPE_MIFARE_4K:
			// All keys are set to FFFFFFFFFFFFh at chip delivery from the factory.
			for (uint8_t i = 0; i < 6; i++) {
				key.keyByte[i] = 0xFF;
			}
			PICC_DumpMifareClassicToSerial(uid, piccType, &key);
			break;

		case PICC_TYPE_MIFARE_UL:
			PICC_DumpMifareUltralightToSerial();
			break;

		case PICC_TYPE_ISO_14443_4:
		case PICC_TYPE_MIFARE_DESFIRE:
		case PICC_TYPE_ISO_18092:
		case PICC_TYPE_MIFARE_PLUS:
		case PICC_TYPE_TNP3XXX:
			msgdebug_size = sprintf(msgdebug, "Dumping memory contents not implemented for that PICC type.");
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 500);
			break;

		case PICC_TYPE_UNKNOWN:
		case PICC_TYPE_NOT_COMPLETE:
		default:
			break; // No memory dump here
	}

	HAL_UART_Transmit(&huart1, (uint8_t *) "\r\n", 2, 100);
	PICC_HaltA(); // Already done if it was a MIFARE Classic PICC.
} // End PICC_DumpToSerial()

/**
 * Dumps card info (UID,SAK,Type) about the selected PICC to Serial.
 */
void MFRC522::PICC_DumpDetailsToSerial(Uid *uid	///< Pointer to Uid struct returned from a successful PICC_Select().
									) {
	// UID

	HAL_UART_Transmit(&huart1, (uint8_t *) "Card UID:", 9, 100);
	for (uint8_t i = 0; i < uid->size; i++) {
		if(uid->uidByte[i] < 0x10)
			HAL_UART_Transmit(&huart1, (uint8_t *) " 0", 2, 100);
		else
			HAL_UART_Transmit(&huart1, (uint8_t *) " ", 1, 100);

		msgdebug_size = sprintf(msgdebug,"%X", uid->uidByte[i]);
		HAL_UART_Transmit(&huart1,(uint8_t *) msgdebug, msgdebug_size, 100);
	}

	HAL_UART_Transmit(&huart1, (uint8_t *) "\r\n", 2, 100);

	// SAK
	HAL_UART_Transmit(&huart1, (uint8_t *) "Card SAK: ", 10, 100);
	if(uid->sak < 0x10)
		HAL_UART_Transmit(&huart1, (uint8_t *) "0", 1, 100);

	msgdebug_size = sprintf(msgdebug,"%02X", uid->sak);
	HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);

	// (suggested) PICC type
	PICC_Type piccType = PICC_GetType(uid->sak);
	msgdebug_size = sprintf(msgdebug, "PICC type: %s", PICC_GetTypeName(piccType));
	HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 500);
} // End PICC_DumpDetailsToSerial()

/**
 * Dumps memory contents of a MIFARE Classic PICC.
 * On success the PICC is halted after dumping the data.
 */
void MFRC522::PICC_DumpMifareClassicToSerial(	Uid *uid,			///< Pointer to Uid struct returned from a successful PICC_Select().
												PICC_Type piccType,	///< One of the PICC_Type enums.
												MIFARE_Key *key		///< Key A used for all sectors.
											) {
	uint8_t no_of_sectors = 0;

	switch (piccType) {
		case PICC_TYPE_MIFARE_MINI:
			// Has 5 sectors * 4 blocks/sector * 16 bytes/block = 320 bytes.
			no_of_sectors = 5;
			break;

		case PICC_TYPE_MIFARE_1K:
			// Has 16 sectors * 4 blocks/sector * 16 bytes/block = 1024 bytes.
			no_of_sectors = 16;
			break;

		case PICC_TYPE_MIFARE_4K:
			// Has (32 sectors * 4 blocks/sector + 8 sectors * 16 blocks/sector) * 16 bytes/block = 4096 bytes.
			no_of_sectors = 40;
			break;

		default: // Should not happen. Ignore.
			break;
	}

	// Dump sectors, highest address first.
	if (no_of_sectors) {
		msgdebug_size = sprintf(msgdebug, "Sector Block   0  1  2  3   4  5  6  7   8  9 10 11  12 13 14 15  AccessBits");
		HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 500);
		for (int8_t i = no_of_sectors - 1; i >= 0; i--) {
			PICC_DumpMifareClassicSectorToSerial(uid, key, i);
		}
	}
	PICC_HaltA(); // Halt the PICC before stopping the encrypted session.
	PCD_StopCrypto1();
} // End PICC_DumpMifareClassicToSerial()

/**
 * Dumps memory contents of a sector of a MIFARE Classic PICC.
 * Uses PCD_Authenticate(), MIFARE_Read() and PCD_StopCrypto1.
 * Always uses PICC_CMD_MF_AUTH_KEY_A because only Key A can always read the sector trailer access bits.
 */
void MFRC522::PICC_DumpMifareClassicSectorToSerial(Uid *uid,			///< Pointer to Uid struct returned from a successful PICC_Select().
													MIFARE_Key *key,	///< Key A for the sector.
													uint8_t sector			///< The sector to dump, 0..39.
													) {
	MFRC522::StatusCode status;
	uint8_t firstBlock;		// Address of lowest address to dump actually last block dumped)
	uint8_t no_of_blocks;		// Number of blocks in sector
	bool isSectorTrailer;	// Set to true while handling the "last" (ie highest address) in the sector.

	// The access bits are stored in a peculiar fashion.
	// There are four groups:
	//		g[3]	Access bits for the sector trailer, block 3 (for sectors 0-31) or block 15 (for sectors 32-39)
	//		g[2]	Access bits for block 2 (for sectors 0-31) or blocks 10-14 (for sectors 32-39)
	//		g[1]	Access bits for block 1 (for sectors 0-31) or blocks 5-9 (for sectors 32-39)
	//		g[0]	Access bits for block 0 (for sectors 0-31) or blocks 0-4 (for sectors 32-39)
	// Each group has access bits [C1 C2 C3]. In this code C1 is MSB and C3 is LSB.
	// The four CX bits are stored together in a nible cx and an inverted nible cx_.
	uint8_t c1, c2, c3;		// Nibbles
	uint8_t c1_, c2_, c3_;		// Inverted nibbles
	bool invertedError;		// True if one of the inverted nibbles did not match
	uint8_t g[4];				// Access bits for each of the four groups.
	uint8_t group;				// 0-3 - active group for access bits
	bool firstInGroup;		// True for the first block dumped in the group

