grivera90/MFRC522_STM32_cpp/mfrc522/MFRC522.cpp
	// Determine position and size of sector.
	if (sector < 32) { // Sectors 0..31 has 4 blocks each
		no_of_blocks = 4;
		firstBlock = sector * no_of_blocks;
	}
	else if (sector < 40) { // Sectors 32-39 has 16 blocks each
		no_of_blocks = 16;
		firstBlock = 128 + (sector - 32) * no_of_blocks;
	}
	else { // Illegal input, no MIFARE Classic PICC has more than 40 sectors.
		return;
	}

	// Dump blocks, highest address first.
	uint8_t byteCount;
	uint8_t buffer[18];
	uint8_t blockAddr;
	isSectorTrailer = true;
	invertedError = false;	// Avoid "unused variable" warning.
	for (int8_t blockOffset = no_of_blocks - 1; blockOffset >= 0; blockOffset--) {
		blockAddr = firstBlock + blockOffset;
		// Sector number - only on first line
		if (isSectorTrailer) {
			if(sector < 10)
				HAL_UART_Transmit(&huart1, (uint8_t *) "   ", 3, 100); // Pad with spaces
			else
				HAL_UART_Transmit(&huart1, (uint8_t *) "  ", 2, 100); // Pad with spaces

			msgdebug_size = sprintf(msgdebug, "%d   ", sector);
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		}
		else {
			HAL_UART_Transmit(&huart1, (uint8_t *) "       ", 7, 100);
		}
		// Block number
		if(blockAddr < 10)
			HAL_UART_Transmit(&huart1, (uint8_t *) "   ", 3, 100); // Pad with spaces
		else {
			if(blockAddr < 100)
				HAL_UART_Transmit(&huart1, (uint8_t *) "  ", 2, 100); // Pad with spaces
			else
				HAL_UART_Transmit(&huart1, (uint8_t *) " ", 1, 100); // Pad with spaces
		}
		msgdebug_size = sprintf(msgdebug, "%d  ", blockAddr);
		HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		// Establish encrypted communications before reading the first block
		if (isSectorTrailer) {
			status = PCD_Authenticate(PICC_CMD_MF_AUTH_KEY_A, firstBlock, key, uid);
			if (status != STATUS_OK) {
				msgdebug_size = sprintf(msgdebug, "PCD_Authenticate() failed: %s\r\n", GetStatusCodeName(status));
				HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 500);
				return;
			}
		}
		// Read block
		byteCount = sizeof(buffer);
		status = MIFARE_Read(blockAddr, buffer, &byteCount);
		if (status != STATUS_OK) {
			msgdebug_size = sprintf(msgdebug, "MIFARE_Read() failed: %s\r\n", GetStatusCodeName(status));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 200);
			continue;
		}
		// Dump data
		for (uint8_t index = 0; index < 16; index++) {
			if(buffer[index] < 0x10)
				HAL_UART_Transmit(&huart1, (uint8_t *) " 0", 2, 100);
			else
				HAL_UART_Transmit(&huart1, (uint8_t *) " ", 1, 100);

			msgdebug_size = sprintf(msgdebug,"%X", buffer[index]);
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);

			if ((index % 4) == 3) {
				HAL_UART_Transmit(&huart1, (uint8_t *) " ", 1, 100);
			}
		}
		// Parse sector trailer data
		if (isSectorTrailer) {
			c1  = buffer[7] >> 4;
			c2  = buffer[8] & 0xF;
			c3  = buffer[8] >> 4;
			c1_ = buffer[6] & 0xF;
			c2_ = buffer[6] >> 4;
			c3_ = buffer[7] & 0xF;
			invertedError = (c1 != (~c1_ & 0xF)) || (c2 != (~c2_ & 0xF)) || (c3 != (~c3_ & 0xF));
			g[0] = ((c1 & 1) << 2) | ((c2 & 1) << 1) | ((c3 & 1) << 0);
			g[1] = ((c1 & 2) << 1) | ((c2 & 2) << 0) | ((c3 & 2) >> 1);
			g[2] = ((c1 & 4) << 0) | ((c2 & 4) >> 1) | ((c3 & 4) >> 2);
			g[3] = ((c1 & 8) >> 1) | ((c2 & 8) >> 2) | ((c3 & 8) >> 3);
			isSectorTrailer = false;
		}

		// Which access group is this block in?
		if (no_of_blocks == 4) {
			group = blockOffset;
			firstInGroup = true;
		}
		else {
			group = blockOffset / 5;
			firstInGroup = (group == 3) || (group != (blockOffset + 1) / 5);
		}

		if (firstInGroup) {
			// Print access bits
			msgdebug_size = sprintf(msgdebug, " [ %d %d %d ] ", ((g[group] >> 2) & 1), ((g[group] >> 1) & 1), ((g[group] >> 0) & 1));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);

			if (invertedError) {
				msgdebug_size = sprintf(msgdebug, " Inverted access bits did not match! ");
				HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
			}
		}

		if (group != 3 && (g[group] == 1 || g[group] == 6)) { // Not a sector trailer, a value block
			int32_t value = (int32_t(buffer[3])<<24) | (int32_t(buffer[2])<<16) | (int32_t(buffer[1])<<8) | int32_t(buffer[0]);
			msgdebug_size = sprintf(msgdebug, " Value=0x%X  Adr=0x%X", value, buffer[12]);
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		}
		HAL_UART_Transmit(&huart1, (uint8_t *) "\r\n", 2, 100);
	}

	return;
} // End PICC_DumpMifareClassicSectorToSerial()

/**
 * Dumps memory contents of a MIFARE Ultralight PICC.
 */
void MFRC522::PICC_DumpMifareUltralightToSerial() {
	MFRC522::StatusCode status;
	uint8_t byteCount;
	uint8_t buffer[18];
	uint8_t i;

	HAL_UART_Transmit(&huart1, (uint8_t *) "Page  0  1  2  3", 16, 100);
	// Try the mpages of the original Ultralight. Ultralight C has more pages.
	for (uint8_t page = 0; page < 16; page +=4) { // Read returns data for 4 pages at a time.
		// Read pages
		byteCount = sizeof(buffer);
		status = MIFARE_Read(page, buffer, &byteCount);
		if (status != STATUS_OK) {
			msgdebug_size = sprintf(msgdebug, "MIFARE_Read() failed: %s\r\n", GetStatusCodeName(status));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 200);
			break;
		}
		// Dump data
		for (uint8_t offset = 0; offset < 4; offset++) {
			i = page + offset;
			if(i < 10)
				HAL_UART_Transmit(&huart1, (uint8_t *) "  ", 2, 100); // Pad with spaces
			else
				HAL_UART_Transmit(&huart1, (uint8_t *) " ", 1, 100); // Pad with spaces

			msgdebug_size = sprintf(msgdebug, "%d  ", i);
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);

			for (uint8_t index = 0; index < 4; index++) {
				i = 4 * offset + index;
				if(buffer[i] < 0x10)
					HAL_UART_Transmit(&huart1, (uint8_t *) " 0", 2, 100);
				else
					HAL_UART_Transmit(&huart1, (uint8_t *) " ", 1, 100);

				msgdebug_size = sprintf(msgdebug,"%X", buffer[i]);
				HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
			}
			HAL_UART_Transmit(&huart1, (uint8_t *) "\r\n", 2, 100);
		}
	}
} // End PICC_DumpMifareUltralightToSerial()

/**
 * Calculates the bit pattern needed for the specified access bits. In the [C1 C2 C3] tuples C1 is MSB (=4) and C3 is LSB (=1).
 */
void MFRC522::MIFARE_SetAccessBits(	uint8_t *accessBitBuffer,	///< Pointer to uint8_t 6, 7 and 8 in the sector trailer. Bytes [0..2] will be set.
									uint8_t g0,				///< Access bits [C1 C2 C3] for block 0 (for sectors 0-31) or blocks 0-4 (for sectors 32-39)
									uint8_t g1,				///< Access bits C1 C2 C3] for block 1 (for sectors 0-31) or blocks 5-9 (for sectors 32-39)
									uint8_t g2,				///< Access bits C1 C2 C3] for block 2 (for sectors 0-31) or blocks 10-14 (for sectors 32-39)
									uint8_t g3					///< Access bits C1 C2 C3] for the sector trailer, block 3 (for sectors 0-31) or block 15 (for sectors 32-39)
								) {
	uint8_t c1 = ((g3 & 4) << 1) | ((g2 & 4) << 0) | ((g1 & 4) >> 1) | ((g0 & 4) >> 2);
	uint8_t c2 = ((g3 & 2) << 2) | ((g2 & 2) << 1) | ((g1 & 2) << 0) | ((g0 & 2) >> 1);
	uint8_t c3 = ((g3 & 1) << 3) | ((g2 & 1) << 2) | ((g1 & 1) << 1) | ((g0 & 1) << 0);
	
	accessBitBuffer[0] = (~c2 & 0xF) << 4 | (~c1 & 0xF);
	accessBitBuffer[1] =          c1 << 4 | (~c3 & 0xF);
	accessBitBuffer[2] =          c3 << 4 | c2;
} // End MIFARE_SetAccessBits()


/**
 * Performs the "magic sequence" needed to get Chinese UID changeable
 * Mifare cards to allow writing to sector 0, where the card UID is stored.
 *
 * Note that you do not need to have selected the card through REQA or WUPA,
 * this sequence works immediately when the card is in the reader vicinity.
 * This means you can use this method even on "bricked" cards that your reader does
 * not recognise anymore (see MFRC522::MIFARE_UnbrickUidSector).
 * 
 * Of course with non-bricked devices, you're free to select them before calling this function.
 */
bool MFRC522::MIFARE_OpenUidBackdoor(bool logErrors) {
	// Magic sequence:
	// > 50 00 57 CD (HALT + CRC)
	// > 40 (7 bits only)
	// < A (4 bits only)
	// > 43
	// < A (4 bits only)
	// Then you can write to sector 0 without authenticating

