grivera90/MFRC522_STM32_cpp/mfrc522/MFRC522.cpp
	PICC_HaltA(); // 50 00 57 CD

	uint8_t cmd = 0x40;
	uint8_t validBits = 7; /* Our command is only 7 bits. After receiving card response,
						  this will contain amount of valid response bits. */
	uint8_t response[32]; // Card's response is written here
	uint8_t received = sizeof(response);
	MFRC522::StatusCode status = PCD_TransceiveData(&cmd, (uint8_t)1, response, &received, &validBits, (uint8_t)0, false); // 40
	if(status != STATUS_OK) {
		if(logErrors) {
			msgdebug_size = sprintf(msgdebug, "Card did not respond to 0x40 after HALT command. Are you sure it is a UID changeable one?\r\nError name: %s\r\n", GetStatusCodeName(status));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 500);
		}
		return false;
	}
	if (received != 1 || response[0] != 0x0A) {
		if (logErrors) {
			msgdebug_size = sprintf(msgdebug, "Got bad response on backdoor 0x40 command: %X (%d  valid bits)\r\n", response[0], validBits);
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 200);
		}
		return false;
	}

	cmd = 0x43;
	validBits = 8;
	status = PCD_TransceiveData(&cmd, (uint8_t)1, response, &received, &validBits, (uint8_t)0, false); // 43
	if(status != STATUS_OK) {
		if(logErrors) {
			msgdebug_size = sprintf(msgdebug, "Error in communication at command 0x43, after successfully executing 0x40\r\nError name: %s\r\n", GetStatusCodeName(status));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 500);
		}
		return false;
	}
	if (received != 1 || response[0] != 0x0A) {
		if (logErrors) {
			msgdebug_size = sprintf(msgdebug, "Got bad response on backdoor 0x43 command: %X (%d  valid bits)\r\n", response[0], validBits);
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 200);
		}
		return false;
	}

	// You can now write to sector 0 without authenticating!
	return true;
} // End MIFARE_OpenUidBackdoor()

/**
 * Reads entire block 0, including all manufacturer data, and overwrites
 * that block with the new UID, a freshly calculated BCC, and the original
 * manufacturer data.
 *
 * It assumes a default KEY A of 0xFFFFFFFFFFFF.
 * Make sure to have selected the card before this function is called.
 */
bool MFRC522::MIFARE_SetUid(uint8_t *newUid, uint8_t uidSize, bool logErrors) {

	// UID + BCC uint8_t can not be larger than 16 together
	if (!newUid || !uidSize || uidSize > 15) {
		if (logErrors) {
			msgdebug_size = sprintf(msgdebug, "New UID buffer empty, size 0, or size > 15 given");
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		}
		return false;
	}

	// Authenticate for reading
	MIFARE_Key key = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
	MFRC522::StatusCode status = PCD_Authenticate(MFRC522::PICC_CMD_MF_AUTH_KEY_A, (uint8_t)1, &key, &uid);
	if (status != STATUS_OK) {

		if (status == STATUS_TIMEOUT) {
			// We get a read timeout if no card is selected yet, so let's select one

			// Wake the card up again if sleeping
//			  uint8_t atqa_answer[2];
//			  uint8_t atqa_size = 2;
//			  PICC_WakeupA(atqa_answer, &atqa_size);

			if (!PICC_IsNewCardPresent() || !PICC_ReadCardSerial()) {
				msgdebug_size = sprintf(msgdebug, "No card was previously selected, and none are available. Failed to set UID.");
				HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
				return false;
			}

			status = PCD_Authenticate(MFRC522::PICC_CMD_MF_AUTH_KEY_A, (uint8_t)1, &key, &uid);
			if (status != STATUS_OK) {
				// We tried, time to give up
				if (logErrors) {
					msgdebug_size = sprintf(msgdebug, "Failed to authenticate to card for reading, could not set UID: %s\r\n", GetStatusCodeName(status));
					HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
				}
				return false;
			}
		}
		else {
			if (logErrors) {
				msgdebug_size = sprintf(msgdebug, "PCD_Authenticate() failed: %s\r\n", GetStatusCodeName(status));
				HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
			}
			return false;
		}
	}

	// Read block 0
	uint8_t block0_buffer[18];
	uint8_t byteCount = sizeof(block0_buffer);
	status = MIFARE_Read((uint8_t)0, block0_buffer, &byteCount);
	if (status != STATUS_OK) {
		if (logErrors) {
			msgdebug_size = sprintf(msgdebug, "MIFARE_Read() failed: %s\r\nAre you sure your KEY A for sector 0 is 0xFFFFFFFFFFFF?\r\n", GetStatusCodeName(status));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		}
		return false;
	}

	// Write new UID to the data we just read, and calculate BCC uint8_t
	uint8_t bcc = 0;
	for (uint8_t i = 0; i < uidSize; i++) {
		block0_buffer[i] = newUid[i];
		bcc ^= newUid[i];
	}

	// Write BCC uint8_t to buffer
	block0_buffer[uidSize] = bcc;

	// Stop encrypted traffic so we can send raw bytes
	PCD_StopCrypto1();

	// Activate UID backdoor
	if (!MIFARE_OpenUidBackdoor(logErrors)) {
		if (logErrors) {
			msgdebug_size = sprintf(msgdebug, "Activating the UID backdoor failed.");
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		}
		return false;
	}

	// Write modified block 0 back to card
	status = MIFARE_Write((uint8_t)0, block0_buffer, (uint8_t)16);
	if (status != STATUS_OK) {
		if (logErrors) {
			msgdebug_size = sprintf(msgdebug, "MIFARE_Write() failed: %s\r\n", GetStatusCodeName(status));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		}
		return false;
	}

	// Wake the card up again
	uint8_t atqa_answer[2];
	uint8_t atqa_size = 2;
	PICC_WakeupA(atqa_answer, &atqa_size);

	return true;
}

/**
 * Resets entire sector 0 to zeroes, so the card can be read again by readers.
 */
bool MFRC522::MIFARE_UnbrickUidSector(bool logErrors) {
	MIFARE_OpenUidBackdoor(logErrors);

	uint8_t block0_buffer[] = {0x01, 0x02, 0x03, 0x04, 0x04, 0x08, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

	// Write modified block 0 back to card
	MFRC522::StatusCode status = MIFARE_Write((uint8_t)0, block0_buffer, (uint8_t)16);
	if (status != STATUS_OK) {
		if (logErrors) {
			msgdebug_size = sprintf(msgdebug, "MIFARE_Write() failed: %s\r\n", GetStatusCodeName(status));
			HAL_UART_Transmit(&huart1, (uint8_t *) msgdebug, msgdebug_size, 100);
		}
		return false;
	}
	return true;
}

/////////////////////////////////////////////////////////////////////////////////////
// Convenience functions - does not add extra functionality
/////////////////////////////////////////////////////////////////////////////////////

/**
 * Returns true if a PICC responds to PICC_CMD_REQA.
 * Only "new" cards in state IDLE are invited. Sleeping cards in state HALT are ignored.
 * 
 * @return bool
 */
bool MFRC522::PICC_IsNewCardPresent() {
	uint8_t bufferATQA[2];
	uint8_t bufferSize = sizeof(bufferATQA);

	// Reset baud rates
	PCD_WriteRegister(TxModeReg, 0x00);
	PCD_WriteRegister(RxModeReg, 0x00);
	// Reset ModWidthReg
	PCD_WriteRegister(ModWidthReg, 0x26);

	MFRC522::StatusCode result = PICC_RequestA(bufferATQA, &bufferSize);
	return (result == STATUS_OK || result == STATUS_COLLISION);
} // End PICC_IsNewCardPresent()

/**
 * Simple wrapper around PICC_Select.
 * Returns true if a UID could be read.
 * Remember to call PICC_IsNewCardPresent(), PICC_RequestA() or PICC_WakeupA() first.
 * The read UID is available in the class variable uid.
 * 
 * @return bool
 */
bool MFRC522::PICC_ReadCardSerial() {
	MFRC522::StatusCode result = PICC_Select(&uid);
	return (result == STATUS_OK);
} // End 
